ci4/app/Controllers/Artikel.php

    public function delete($id)
{
    $artikel = new \App\Models\ArtikelModel();

    // Periksa apakah data ada sebelum dihapus
    $data = $artikel->find($id);
    if (!$data) {
        throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Artikel dengan ID $id tidak ditemukan.");
    }

    // Hapus data
    $artikel->delete($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '4'
DELETE FROM `artikel`
WHERE `id` IN ('4')